# IsValidCircuitNamingSchemeId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalEquipment..::..IsValidCircuitNamingSchemeId Method
ElectricalEquipment Class See Also
---
Verifies that the circuit naming scheme id can be used with Electrical Equipment.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static bool IsValidCircuitNamingSchemeId(
	Document aDocument,
	ElementId circuitNamingSchemeId
)
```

Visual Basic
---
```text
Public Shared Function IsValidCircuitNamingSchemeId ( _
	aDocument As Document, _
	circuitNamingSchemeId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidCircuitNamingSchemeId(
	Document^ aDocument,
	ElementId^ circuitNamingSchemeId
)
```

# ### Parameters
aDocument
    Type: Autodesk.Revit.DB..::..Document The document.
circuitNamingSchemeId
    Type: Autodesk.Revit.DB..::..ElementId The circuit naming scheme id to be checked.
# ### Return Value
True if the circuit naming scheme id is valid for Electrical Equipment.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace